/******************************************************************************
*Copyright(C),2025,Shenzhen Bestchain Technology CO.,LTD.
*FileName   :dsp_base.c
*Author     :Wei Youfu
*Version    :v1.0
*Date       :2025.3.5
*Description:时钟频率：外部10MHz晶振，系统时钟60MHz
*            OSCCLK：10MHz
*            LOSPCP.LSPCLK:2    PLLCR.DIV:12    PLLSTS.DIVSEL:2(value is 2)
*            SYSCKOUT:(OSCCLK*DIV)/DIVSEL = 10MHz * 12 / 2 = 60MHz
*            Low speed clock:SYSCLKOUT/(LSPCLK*2)=60MHz/4 = 15MHz
*
*            注意：ADC最大转换时钟为60MHz，系统时钟超过60MHz，ADC输入时钟需要2分频，
*                  如果系统时钟为100MHZ时，ADC时钟为50MHz
*Others     :
*History    :<date>,<author>,<modify>
******************************************************************************/
/******************************************************************************
Includes
-----------------------------------------------------------------------------*/
#include "dsp_base.h"

/******************************************************************************
External declarations
-----------------------------------------------------------------------------*/
extern Uint16 RamfuncsLoadStart;
extern Uint16 RamfuncsLoadEnd;
extern Uint16 RamfuncsRunStart;

/******************************************************************************
Defines and macros
-----------------------------------------------------------------------------*/

/******************************************************************************
Typedefs and structures
-----------------------------------------------------------------------------*/

/******************************************************************************
Global variable definitions
-----------------------------------------------------------------------------*/

/******************************************************************************
Function prototypes
-----------------------------------------------------------------------------*/

/******************************************************************************
Function implementations
-----------------------------------------------------------------------------*/
/******************************************************************************
*Description:
*Input:
*Output:
-----------------------------------------------------------------------------*/
void DSP_Base_Init(void)
{
	//把需要在RAM运行的代码从FLASH复制到RAM区，该RAM区域是“ramfuncs”，
	//位于RAM_L0：0x008000，长度0x800 word
	MemCopy(&RamfuncsLoadStart, &RamfuncsLoadEnd, &RamfuncsRunStart);
	
	//1.使能ADC校准
	//2.切换使用外部晶振
	//3.开启PLL，设置时钟倍频数，时钟分频数，使系统时钟达到10MHz*12/2=60MHz
	//4.设置低速外设时钟SYSCLKOUT/(XCLKOUTDIV*2)=15MHz
	//5.开启所需用到外设的时钟
	InitSysCtrl();
	
	//设置FLASH的读等待周期，开启指令流水线模式
	InitFlash();
	
	//禁止CPU中断
	DINT;
    ADP32F03x_usDelay(1000);
	
	//清空PIE寄存器
	InitPieCtrl();
    IER = 0x0000;
    IFR = 0x0000;
	
	//初始化中断向量表
	InitPieVectTable();
}

/******************************************************************************
*Description:系统底层初始化完成后，使能总中断
-----------------------------------------------------------------------------*/
void DSP_INT_Enable(void)
{
    PieCtrlRegs.PIECTRL.bit.ENPIE = 1;
    EINT;
    ERTM;
}


























/* End of file */
