/******************************************************************************
文件名                     : AVP32F08_Project.h
作者                         : 湖南进芯电子科技有限公司
功能描述                 : AVP32F08工程头文件和例程头文件
创建时间                 : 07-21-2022
版本                         : V1.0
修订时间                 :
修订内容                 :
*******************************************************************************/

#ifndef AVP32F08_PROJECT_H
#define AVP32F08_PROJECT_H

#include "AVP32F08_Device.h"     // AVP32F08 Headerfile Include File
#include "AVP32F08_Examples.h"   // AVP32F08 Examples Include File

#endif  // end of AVP32F08_Project_H definition

//===========================================================================
// End of file.
//===========================================================================
