/******************************************************************************
文件名                     : AVP33x_MemCopy.h
作者                         : 湖南进芯电子科技有限公司
功能描述                 : 内存复制函数：将制定的代码或数据从一个地方复制到另一个地方
             Uint16 *SourceAddr：被搬移内容所处的首地址
             Uint16 *SourceEndAddr：被搬移内容所处的末地址
             Uint16* DestAddr：搬移目标位置的首地址
                                       对于无效地址或首地址>末地址的情况是不做校核的。
创建时间                 : 06-25-2019
版本                         : V1.0
修订时间                 :
修订内容                 :
*******************************************************************************/

#include "AVP33x_Device.h"

void MemCopy(Uint16 *SourceAddr, Uint16* SourceEndAddr, Uint16* DestAddr)
{
    while(SourceAddr < SourceEndAddr)
    { 
       *DestAddr++ = *SourceAddr++;
    }
    return;
}

//===========================================================================
// End of file.
//===========================================================================
