/******************************************************************************
文件名                     : AVP33x_Project.h
作者                         : 湖南进芯电子科技有限公司
功能描述                 : AVP33x工程头文件和例程头文件
创建时间                 : 06-25-2019
版本                         : V1.0
修订时间                 :
修订内容                 :
*******************************************************************************/

#ifndef AVP33x_PROJECT_H
#define AVP33x_PROJECT_H

#include "AVP33x_Device.h"     // AVP33x Headerfile Include File
#include "AVP33x_Examples.h"   // AVP33x Examples Include File

#endif  // end of AVP33x_Project_H definition

//===========================================================================
// End of file.
//===========================================================================
